In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv(r'C:\Users\Aarav\Desktop\end to end data sets\property_data.csv')

In [4]:
data

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

# Characteristics of Data

In [5]:
data.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN        1   850
3  100004000.0   201.0   BERKELEY           12            1      NaN   700
4          NaN   203.0   BERKELEY            Y            3        2  1600

In [6]:
data.tail()

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [7]:
data.describe(include = 'all')

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
count,8.000000e+00,7.000000,9,8,7,8,8
unique,NaN,NaN,5,3,4,4,8
top,NaN,NaN,BERKELEY,Y,3,1,800
freq,NaN,NaN,3,5,3,4,1
mean,1.000050e+08,191.428571,NaN,NaN,NaN,NaN,NaN
std,2.927700e+03,39.080503,NaN,NaN,NaN,NaN,NaN
min,1.000010e+08,104.000000,NaN,NaN,NaN,NaN,NaN
25%,1.000028e+08,199.000000,NaN,NaN,NaN,NaN,NaN
50%,1.000050e+08,203.000000,NaN,NaN,NaN,NaN,NaN
75%,1.000072e+08,210.000000,NaN,NaN,NaN,NaN,NaN
max,1.000090e+08,215.000000,NaN,NaN,NaN,NaN,NaN

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
PID             8 non-null float64
ST_NUM          7 non-null float64
ST_NAME         9 non-null object
OWN_OCCUPIED    8 non-null object
NUM_BEDROOMS    7 non-null object
NUM_BATH        8 non-null object
SQ_FT           8 non-null object
dtypes: float64(2), object(5)
memory usage: 584.0+ bytes

In [9]:
data.shape

(9, 7)

In [10]:
data.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS     object
NUM_BATH         object
SQ_FT            object
dtype: object

# Finding out the STANDARD MISSING values through pandas: "isnull()"

In [11]:
data.isnull().sum()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    2
NUM_BATH        1
SQ_FT           1
dtype: int64

In [12]:
data['PID'].isnull()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
Name: PID, dtype: bool

In [13]:
print(data['PID'])

0    100001000.0
1    100002000.0
2    100003000.0
3    100004000.0
4            NaN
5    100006000.0
6    100007000.0
7    100008000.0
8    100009000.0
Name: PID, dtype: float64

In [14]:
data['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [15]:
print(data['ST_NUM'])

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

# Finding out the NON STANDARD MISSING VALUES through "value_counts()"

In [16]:
# There might be the case where there are different formats of missing values. Let us look at column "Number_Bedrooms".
print(data['NUM_BEDROOMS'])

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7      1
8     na
Name: NUM_BEDROOMS, dtype: object

In [17]:
# Non standard missing values can be found out by using value_counts()
data['NUM_BEDROOMS'].value_counts()

3     3
1     2
na    1
2     1
Name: NUM_BEDROOMS, dtype: int64

In [18]:
#An easy way to detect all these formats ( na , n/a , --) is to put them into a list.
#Then, when we import the data, Pandas will recognize them right away.

In [19]:
# Making a list of missing value types
missing_values = ["NaN","na","--","n/a","NA"]
real_estate_data = pd.read_csv(r"C:\Users\Aarav\Desktop\end to end data sets\property_data.csv",na_values=missing_values)

In [20]:
real_estate_data.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS    float64
NUM_BATH         object
SQ_FT           float64
dtype: object

In [ ]:
# Looking at the column NUM_BEDROOMS Again
print("Number of bedrooms of property_dataset\n\n",real_estate_data['NUM_BEDROOMS'])

In [ ]:
print("\n Null values in the column\n\n",real_estate_data['NUM_BEDROOMS'].isnull())

In [ ]:
print(real_estate_data["NUM_BATH"])
print("\n null values : \n", real_estate_data["NUM_BATH"].isnull())

# UNEXPECTED MISSING VALUES

In [ ]:
#For example, if our feature is expected to be a string and we have a numeric type, technically this is also a missing value.
#Let us look at the column "Owner Occupied" inorder to understand it properly.

In [21]:
print("Data of column OWN_OCCUPIED\n\n",real_estate_data["OWN_OCCUPIED"])
# Checking for null values in the column
print("\n Check for null values in col OWN_OCCUPIED\n\n",real_estate_data["OWN_OCCUPIED"].isnull())

Data of column OWN_OCCUPIED

 0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

 Check for null values in col OWN_OCCUPIED

 0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [23]:
# Detecting numbers in column "OWN_OCCUPIED"
count = 0
for row in real_estate_data["OWN_OCCUPIED"]:
    try:
        int(row)
        real_estate_data.loc[count,"OWN_OCCUPIED"]=np.nan
    except ValueError:
        pass
    count+=1

In [25]:
print("Data of column OWN_OCCUPIED\n\n",real_estate_data["OWN_OCCUPIED"])
# Checking for null values in the column
print("\n Check for null values in col OWN_OCCUPIED\n\n",real_estate_data["OWN_OCCUPIED"].isnull())

Data of column OWN_OCCUPIED

 0      Y
1      N
2      N
3    NaN
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

 Check for null values in col OWN_OCCUPIED

 0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [ ]:
# Total missing values for each feature
print("Missing Values for each feature\n\n",real_estate_data.isnull().sum())

In [ ]:
real_estate_data.head(10)

# Summarizing missing values

In [ ]:
# Total missing values for each feature
print("Missing Values for each feature\n\n",real_estate_data.isnull().sum())

In [ ]:
# We can also get the total count of missing values
print("Total count of missing values : ",real_estate_data.isnull().sum().sum())

# Replacing missing values

In [ ]:
real_estate_data.head(10)

In [ ]:
# Replace missing values with a number
real_estate_data['ST_NUM'].fillna(125,inplace=True)
real_estate_data['ST_NUM']

In [ ]:
# We can also impute using a character variable instead of a number.
real_estate_data['NUM_BATH'].fillna('missing',inplace=True)
real_estate_data['NUM_BATH']

In [ ]:
real_estate_data.head(10)

In [ ]:
# Replace using median
med = real_estate_data['SQ_FT'].median()
real_estate_data['SQ_FT'].fillna(med,inplace=True)
real_estate_data['SQ_FT']

In [9]:
mde = real_estate_data['OWN_OCCUPIED'].mode()
real_estate_data['OWN_OCCUPIED'].fillna(mde,inplace=True)
real_estate_data['OWN_OCCUPIED']

0      Y
1      N
2      N
3    NaN
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

In [ ]:
real_estate_data.loc[6,'NUM_BATH']=1
real_estate_data['NUM_BATH']

In [ ]:
real_estate_data.head(10)

In [ ]:
real_estate_data.loc[3,'OWN_OCCUPIED']= 'Y'
real_estate_data['OWN_OCCUPIED']

In [ ]:
real_estate_data.head(10)

In [ ]:
# Replace using median
median = real_estate_data['NUM_BEDROOMS'].median()
real_estate_data['NUM_BEDROOMS'].fillna(median,inplace=True)
real_estate_data['NUM_BEDROOMS']

In [ ]:
real_estate_data.isnull().sum()

In [ ]:
real_estate_data.loc[4,'PID']= 100004000.0
real_estate_data['PID']

In [ ]:
real_estate_data.head(10)

In [26]:
real_estate_data['OWN_OCCUPIED'].fillna(method='ffill')

0    Y
1    N
2    N
3    N
4    Y
5    Y
6    Y
7    Y
8    Y
Name: OWN_OCCUPIED, dtype: object